app/Models/MahasiswaModel.php

    public function getMahasiswa($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
---
SELECT *
FROM `mahasiswa`